my_dict = {'Denis': 1992, 'Max': 1993, 'Witas': 1994, 'Santa': 1995 } # словарь из нескольких пар ключ-значение
print(my_dict) # выводит на экран словарь my_dict
print(my_dict['Denis']) # выводит на экран одно значение по существующему ключу
print(my_dict.get('Miha', 'Нет такого года рождения:')) # выводит одно по отсутствующему из словаря my_dict без ошибки
print(my_dict.update({'Anton': 2006,
                      'Ivan': 2007} )) # добавляет две произвольные пары того же формата в словарь my_dict
print(my_dict.pop('Max'))
"""удаляет одну из пар в словаре по существующему ключу из словаря,выводит значение из этой пары на экран"""
print(my_dict) # выводит на экран словарь my_dict

my_set = {7, 'Слива', 3.14, 56, 28, 'Слива', 13, 7, 13, 8}
"""множество, состоящее из разных типов данных с повторяющимися значениями"""
print(my_set) # выводит на экран множество my_set (отображаются только уникальные значения
my_set.update([6, 10]) # добавляет 2 произвольных элемента в множество my_set, которых ещё нет
my_set.discard('Слива')# удаляет один элемент из множества my_set
print(my_set) # выводит на экран измененное множество my_set
